In [2]:
try:
    b = open('class530.txt', 'x')
    b.close()
except:
    print("The file is already there.")

The file is already there.

In [6]:

#read() reading content from file 
b = open ('class530.txt', 'r')
print(b.readline())
print(b.readline())

Hello World!!!

Hello World!!!

#read() reading content from file

In [4]:
#read() reading content from file 
b = open('class530.txt')
c = b.read()
print(c)

Hello World!!!
Hello World!!!
Hello World!!!
Hello World!!!
Hello World!!!

In [12]:
b = open('class530.csv','w')
b.write("Sn,Name,Address,Age,Phone,Blood Group\n")
data = ""
n = int(input("Enter how many people = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    add = input("Enter address = ")
    phone = int(input("Enter the phone number = "))
    bgroup = input("Enter Blood Group = ")
    age = int(input("Enter the age = "))
    info = f"{i},{name},{add},{age},{phone},{bgroup}\n"
    data = data+info
    
b.write(data)
b.close()

Enter how many people = 5
Enter name = Ram
Enter address = Kathmandu
Enter the phone number = 9887464873
Enter Blood Group = O-
Enter the age = 45
Enter name = Hari
Enter address = Patan
Enter the phone number = 987897353
Enter Blood Group = A-
Enter the age = 23
Enter name = Johnathan
Enter address = Uganda
Enter the phone number = 334324876
Enter Blood Group = B+
Enter the age = 19
Enter name = David
Enter address = California
Enter the phone number = 1847329843
Enter Blood Group = A+
Enter the age = 34
Enter name = Andrea
Enter address = Mexico
Enter the phone number = 98473392323
Enter Blood Group = A+
Enter the age = 18

In [13]:
b = open('class530.csv','r')
c = b.read()
print(c)
b.close()

Sn,Name,Address,Age,Phone,Blood Group
1,Ram,Kathmandu,45,9887464873,O-
2,Hari,Patan,23,987897353,A-
3,Johnathan,Uganda,19,334324876,B+
4,David,California,34,1847329843,A+
5,Andrea,Mexico,18,98473392323,A+

In [17]:
d = c.split('\n')
print(d)

['Sn,Name,Address,Age,Phone,Blood Group', '1,Ram,Kathmandu,45,9887464873,O-', '2,Hari,Patan,23,987897353,A-', '3,Johnathan,Uganda,19,334324876,B+', '4,David,California,34,1847329843,A+', '5,Andrea,Mexico,18,98473392323,A+', '']

In [20]:
e = d[2:-1]
print(e)

['2,Hari,Patan,23,987897353,A-', '3,Johnathan,Uganda,19,334324876,B+', '4,David,California,34,1847329843,A+', '5,Andrea,Mexico,18,98473392323,A+']

In [21]:
final_data = []
for i in e:
    x = i.split(',')
    final_data.append(x)
print(final_data)

[['2', 'Hari', 'Patan', '23', '987897353', 'A-'], ['3', 'Johnathan', 'Uganda', '19', '334324876', 'B+'], ['4', 'David', 'California', '34', '1847329843', 'A+'], ['5', 'Andrea', 'Mexico', '18', '98473392323', 'A+']]

In [15]:
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
print(df)

         Name     Address  Age        Phone Blood Group
Sn
1         Ram   Kathmandu   45   9887464873          O-
2        Hari       Patan   23    987897353          A-
3   Johnathan      Uganda   19    334324876          B+
4       David  California   34   1847329843          A+
5      Andrea      Mexico   18  98473392323          A+

In [16]:
import pandas as pd
l = ['Sn','Name','Address']
df = pd.read_csv('class530.csv', index_col = 'Sn', usecols = l)
print(df)

         Name     Address
Sn
1         Ram   Kathmandu
2        Hari       Patan
3   Johnathan      Uganda
4       David  California
5      Andrea      Mexico

In [24]:
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
df.iloc[0:5,0:4] #[row,coloumn] normal index ranging

         Name     Address  Age        Phone
Sn
1         Ram   Kathmandu   45   9887464873
2        Hari       Patan   23    987897353
3   Johnathan      Uganda   19    334324876
4       David  California   34   1847329843
5      Andrea      Mexico   18  98473392323

In [28]:
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
df.iloc[2:5,2:4] #[row,coloumn] (normal index ranging, iloc is for slicing rows and coloumns)

    Age        Phone
Sn
3    19    334324876
4    34   1847329843
5    18  98473392323

In [35]:
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
df.loc["Ram":"Johnathan"] #df.loc (loc means localizer, loc is only for slicing rows)

Empty DataFrame
Columns: [Name, Address, Age, Phone, Blood Group]
Index: []

In [36]:
#data Filtering
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
df[df['Age'] > 30]

     Name     Address  Age       Phone Blood Group
Sn
1     Ram   Kathmandu   45  9887464873          O-
4   David  California   34  1847329843          A+

In [37]:
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
df[(df['Age'] > 30) & (df['Address'] == 'Kathmandu')]

   Name    Address  Age       Phone Blood Group
Sn
1   Ram  Kathmandu   45  9887464873          O-

In [38]:
import pandas as pd
df = pd.read_csv('class530.csv', index_col = 'Sn')
df1 = df[(df['Age'] > 30) & (df['Address'] == 'Kathmandu')]
df1.to_csv('newdat.csv') #creates a new file and inserts the filtered data from df1 to 'newdat.csv'

In [39]:
import pandas as pd
a = {"Name":['Ram', 'hari', 'Gita'], 
    "Age":[45,56,67],
    "Address":["Kathmandu", "Patan", "Lalitpur"]}
df = pd.DataFrame(a)
df.to_csv('small_data.csv')
df

   Name  Age    Address
0   Ram   45  Kathmandu
1  hari   56      Patan
2  Gita   67   Lalitpur

In [13]:
import csv
fields = [6,"Andy","Philadelphia",21,97473392323,"B+"]
g= open('class530.csv','a') 
x = csv.writer(g)
x.writerow(fields)

39

In [28]:
n = int(input("ENter n = "))
f = open('bill.csv','a')
x = csv.writer(f)
x.writerow(['Sn','Name','Price','Quantity','Total'])
for i in range(1,n+1):
    try:
        name = input("Enter the name of the product = ")
        price = int(input("Enter the price = "))
        quantity = int(input("Enter the quantity ="))
    except:
        print("Invalid data.")
    total = price*quantity
    a = [i, name, price, quantity, total]
    x.writerow(a)

ENter n = 2
Enter the name of the product = Rose
Enter the price = 300
Enter the quantity =2
Enter the name of the product = Hibiscis
Enter the price = 400
Enter the quantity =4

In [29]:
import pandas as pd
df = pd.read_csv('bill.csv')
df

   Sn      Name  Price  Quantity  Total
0   1      Rose    300         3    900
1   2  Hibiscus    400         3   1200

In [30]:
#Changing a csv file into a list inside dictionary
import csv
f = open('bill.csv')
reader = csv.DictReader(f)
for row in reader:
    print(row)
f.close()

{None: ['Sn', 'Name', 'Price', 'Quantity', 'Total']}
{None: ['1', 'Rose', '300', '3', '900']}
{None: ['2', 'Hibiscus', '400', '3', '1200']}

In [36]:
#chaging a dictionary inside list data into a csv file!
import csv 
csv_columns = ["Name","Age","Address"]
dict = [
    {'Name':'Aayush', 'Age':23, 'Address':'KAthamandu'},
    {'Name':'Ram', 'Age':43, 'Address':'Patan'}
]
f = open('data.csv', 'w')
writer = csv.DictWriter(f,fieldnames =csv_columns)
writer.writeheader()
for data in dict:
    writer.writerow(data)